Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByParts Method
Overload List
Name | Description
CreateBentPlateByParts(Part, Part)
 Modifies the first plate by adding a cylindrical bend that connects it to the second plate creating a new BentPlate instance based on two parts. See CreateBentPlateByParts(Part, Part, BentPlate.BendShape).
CreateBentPlateByParts(Part, Part, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and a radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, Double).
CreateBentPlateByParts(Part, Part, BentPlate.BendShape)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, BentPlate.BendShape).
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace